# StorageType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Parameter..::..StorageType Property
Parameter Class See Also
---
Describes the type that is used internally within the parameter to store its value.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public StorageType StorageType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property StorageType As StorageType
	Get
```

Visual C++
---
```text
public:
property StorageType StorageType {
	StorageType get ();
}
```

# Remarks
The property will return one of the following possibilities: String, Integer, Double or ElementId. Based on the value of this property the correct access and set methods should be used to retrieve and set the parameter's data value.
# See Also
Parameter Class
Autodesk.Revit.DB Namespace